# frozen_string_literal: true

# Dual Panel File Browser
cask 'marta'

# Fast GPU rendered terminal emulator
cask 'wezterm'

# best screenshot tool on mac
cask 'cleanshot'

# setup a hyper key modifier
cask 'hyperkey'

# note taking app and Zettlekasten
cask 'obsidian'

# spotlight alternative
cask 'raycast'

# a terminal emulator (used primarily for wrapping terminal apps)
cask 'iterm2'

# allow accessing passwords from a CLI
cask '1password/tap/1password-cli'

# macOS automation using Lua
cask 'hammerspoon'

# for Erlang
brew 'wxwidgets'
brew 'autoconf'
brew 'fop'
brew 'libiodbc'
brew 'openjdk'

# for generating graphics
brew 'graphviz'

# code stats
brew 'scc'

# SQLite3
brew 'sqlite'

# image manipulation
brew 'imagemagick'

# json querying + pretty printing
brew 'jq'

# json exploration
brew 'fx'

# html querying aka hq
brew 'htmlq'

# easily copy tabular data
brew 'yank'

# format postgres sql files
brew 'pgformatter'

# Postgres pager
brew 'pspg'

# Postgres client
brew 'libpq'

# quickly jump to recently used folders
brew 'autojump'

# better cat with syntax highlighting
brew 'bat'

# compile C stuff
brew 'cmake'

# fuzzy finder
brew 'fzf'

# c++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'btop'

# GitHub CLIs
brew 'gh'

# docker desktop for containers
cask 'docker'

# curses interface for docker + git
brew 'lazydocker'
brew 'lazygit'

# build tool
brew 'make'

# terminal multiplexer
brew 'tmux'

# vimium like jumps in tmux
tap 'morantron/tmux-fingers'
brew 'morantron/tmux-fingers/tmux-fingers'

# download files from the terminal, used by some scripts
brew 'wget'

# Reattach process (e.g., TMux) to background
brew 'reattach-to-user-namespace'

# display system info
brew 'neofetch'

# OpenSSL - important for compiling things that support SSL
brew 'openssl@1.1'

# linter for bash scripts
brew 'shellcheck'

# keep ZSH up to date
brew 'zsh'

# required by ccls
brew 'llvm'

# the watch command
brew 'watch'

# set default application for opening files on mac
brew 'duti'

# for Nerves
brew 'xz'
brew 'pkg-config'
brew 'squashfs'
brew 'fwup'

# GNU File, Shell, and Text utilities (also required by Nerves)
# https://www.gnu.org/software/coreutils
brew 'coreutils'

# TUI utils for scripting
brew 'gum'

# a modern API client with a friendly DX
brew 'httpie'

# a more up to date version of curl than what macOS offers
brew 'curl'

# run things in parallel
brew 'parallel'

# ask questions in natural language and get results in the terminal
brew 'howdoi'

# pretty text display utils
brew 'figlet'

# kubernetes tools
brew 'kubectx'
brew 'helm'

# Mac App Store CLI
brew 'mas'

# yet another tmux session manager
brew 'smug'

# for formatting XML files
brew 'xq'

# better shell completions
brew 'carapace'
