# frozen_string_literal: true

# Dual Panel File Browser
cask 'marta'

# Fast GPU rendered terminal emulator
cask 'alacritty'

# allow accessing passwords from a cli
cask '1password/tap/1password-cli'

# for erlang
brew 'wxwidgets'
brew 'autoconf'
brew 'fop'
brew 'libiodbc'
brew 'openjdk'

# used by my alfred workflow (Default Browser)
brew 'defaultbrowser'

# code stats
brew 'scc'

# sqlite3
brew 'sqlite'

# image manipulation
brew 'imagemagick'

# json querying + pretty printing
brew 'jq'

# html querying
brew 'htmlq'

# easily copy tabular data
brew 'yank'

brew 'pgformatter'

# postgres pager
brew 'pspg'

# for neovim
brew 'lua'

# ls replacement with icons and colors (rust)
brew 'exa'

# quickly jump to recently used folders
brew 'autojump'

# better cat with syntax highlighting
brew 'bat'

# compile C stuff
brew 'cmake'

# auto run env scripts when entering a dir
brew 'direnv'

# fuzzy finder
brew 'fzf'

# c++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'htop'

# Github CLIs
brew 'gh'

# docker desktop for containers
cask 'docker'

# curses interface for docker + git
brew 'lazydocker'
brew 'lazygit'

# build tool
brew 'make'

# terminal multiplexer
brew 'tmux'

# tmux for remote pairing
brew 'tmate'

# download files from the terminal, used by some scripts
brew 'wget'

# Reattach process (e.g., tmux) to background
brew 'reattach-to-user-namespace'

# display system info
brew 'neofetch'

# best code editor on planet earth
brew 'neovim'

# OpenSSL - important for compiling things that support ssl
brew 'openssl@1.1'

# better, faster grep
brew 'ripgrep'

# like grep but for files and folder names
brew 'fd'

# linter for bash scripts
brew 'shellcheck'

# keep tree up to date
brew 'tree'

# keep zsh up to date
brew 'zsh'

# enable ocr via an Alfred workflow
brew 'tesseract'

# required by ccls
brew 'llvm'

# the watch command
brew 'watch'

# set default application for opening files on mac
brew 'duti'

# for Nerves
brew 'xz'
brew 'pkg-config'
brew 'squashfs'
brew 'fwup'

# GNU File, Shell, and Text utilities (also required by Nerves)
# https://www.gnu.org/software/coreutils
brew 'coreutils'

