# frozen_string_literal: true

# Dual Panel File Browser
cask 'marta'

# Fast GPU rendered terminal emulator
cask 'wezterm'

# best screenshot tool on mac
cask 'cleanshot'

# setup a hyper key modifier
cask 'hyperkey'

# note taking app and Zettlekasten
cask 'obsidian'

# spotlight alternative
cask 'raycast'

# a terminal emulator (used primarily for wrapping terminal apps)
cask 'iterm2'

# allow accessing passwords from a CLI
cask '1password-cli'

# run open source LLM models locally
cask 'ollama-app'

# primary terminal app
cask 'ghostty'

# for Erlang
brew 'wxwidgets'
brew 'autoconf'
brew 'fop'
brew 'libiodbc'
brew 'openjdk'

# for generating graphics
brew 'graphviz'

# code stats
brew 'scc'

# SQLite3
brew 'sqlite'

# image manipulation
brew 'imagemagick'

# easily copy tabular data
brew 'yank'

# format postgres sql files
brew 'pgformatter'

# Postgres pager
brew 'pspg'

# Postgres client
brew 'libpq'

# compile C stuff
brew 'cmake'

# c++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'btop'

# docker desktop for containers
cask 'docker-desktop'

# build tool
brew 'make'

# terminal multiplexer
brew 'tmux'

# process video files (used by yazi, but also ffmpeg is very useful in general)
brew 'ffmpeg'
brew 'ffmpegthumbnailer'

# vimium like jumps in tmux
tap 'morantron/tmux-fingers'
brew 'morantron/tmux-fingers/tmux-fingers'

# sudo with touch id
tap 'dkarter/tap'
brew 'dkarter/tap/sudo-touchid'
# sudo touch id support for tmux
brew 'pam-reattach'

# download files from the terminal, used by some scripts
brew 'wget'

# OpenSSL - important for compiling things that support SSL
brew 'openssl'

# linter for bash scripts
brew 'shellcheck'

# keep ZSH up to date
brew 'zsh'

# required by ccls
brew 'llvm'

# the watch command
brew 'watch'

# set default application for opening files on mac
brew 'duti'

# for Nerves
brew 'xz'
brew 'pkg-config'
brew 'squashfs'
brew 'fwup'

# GNU File, Shell, and Text utilities (also required by Nerves)
# https://www.gnu.org/software/coreutils
brew 'coreutils'

# a more up to date version of curl than what macOS offers
brew 'curl'

# run things in parallel
brew 'parallel'

# pretty text display utils
brew 'figlet'

# Mac App Store CLI
brew 'mas'
